# 学习态度
# python基础 2个月
# html css js jq  1个月

# 上课困

# 学习方法 ：
    # 列出知识点
    # 例子 写了哪些

# 面向对象学了哪些块
    # 为什么要讲面向对象
        # 角色的不清晰，导致了方法的调用混乱
        # 重复的代码
    # 类和对象的定义 语法
    # 对象与对象之间的交互  ： 人打狗 狗掉血
    # 面向对象的命名空间
    # 组合

    # 面向对象的三大特性
        # 继承  单继承 父类 子类
               #多继承 经典类和新式类的区别 抽象类和接口类（规范）
        # 多态（其他语言中的，python天生支持） 鸭子类型（list和tuple）
        # 封装 私有的 __变量
        # @property
        # @classmethod
        # @staticmethod

    # 面向对象的进阶
        # issubclass isinstance
        # 反射 hasattr getattr
        # 内置的方法：
            # 内置方法和内置函数和内置的数据类型以及内置的模块都有着千丝万缕的联系
            # __new__ 创建self 构造方法
            # __call__ 对象()

# 写代码 两种思路
# 面向过程
# 面向函数
# 面向对象











