# 整体进度
# python基础  ——38天   2个月
# 数据库 —— 存储数据和信息用的，本质上和文件没有区别  1-2周
       # —— 增删改查更方便了
# 前端 —— 2周
# 框架 —— django    2个月
# linux基础 2周
# 6个月毕业

# python 基础
# 基础数据类型
# 流程控制 —— 条件判断和各种循环
# 为什么要有文件处理（# 文件里存储的是用户名和密码）
    # 内存 —— 硬盘
# 函数  —— 两周
# 面向对象和模块 —— 两周
# 网络编程 —— 一周
# 并发编程 —— 一周

# 纪律
# 早默写 —— 坚持
# 下午的时间安排
    # 2:30 上自习
    # 前半个小时 回忆上课讲了什么
    # 3:00 看视频    —— 4:30
    # 多动手 敲代码
        # 先敲课上的内容 —— 5:00
        # 看一遍作业 —— 5:30之前
    # 6:30——8:00 写作业
    # 8:00 —— 8:30 安排讨论





